Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཁྱོད་ཀྱིས་དགེ་བར་གསུངས་པ་ལེགས་སོ།
en: Respected Blessed One, your virtuous words are excellent!

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐོགས་པ་མ་མཆིས་པའི་ཡེ་ཤེས་མཐོང་བ་ནི་ངོ་མཚར་ལགས་སོ།
en: The unimpeded wisdom vision of the blessed buddhas is amazing!

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ལ་སུ་ཞིག་འདུན་པ་སྐྱེད་པར་མི་བགྱིད་ལགས།
en: Who would not form this intention to reach unsurpassed and perfect awakening?

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མིག་ཏུ་གྱུར་པ། ཡེ་ཤེས་སུ་གྱུར་པ།
en: Thus-Gone One, you are the eyes and the wisdom of all sentient beings.

source: སྡུག་བསྔལ་ཐམས་ཅད་ཉེ་བར་ཞི་བར་བགྱིད་པར་གྱུར་པ། བདེ་བ་ཐམས་ཅད་སྦྱིན་པར་མཛད་པ། འཁོར་བའི་གཟིངས་སུ་གྱུར་པ་ལགས་སོ།
en: You pacify all their sufferings, you bestow happiness upon them, and you are the raft that leads them across saṃsāra!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽ་ཌི་ནྱས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོས་གཟུངས་སྔགས་ཉི་མའི་མིག་བསྟན་པ་བསྲུང་བ་ཆེན་པོ་མ་འདྲེས་པ་ཐམས་ཅད་སྒྲུབ་པ་ཞེས་བགྱི་བ་ནས་ཤིན་ཏུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་སྒྲུབ་པ་ཞེས་བགྱི་བའི་བར་དང་།
en: Then, Venerable Ājñātakauṇḍinya asked the Blessed One, “Respected Blessed One, what is the dhāraṇī mantra, the sun’s eye, that the bodhisattva great being Quintessence of the Sun’s Energy has revealed?

source: གཟུངས་སྔགས་གང་གིས་སྐྱེས་བུ་དམ་པ་རྣམས་སྲིད་པ་གསུམ་གྱི་བཙོན་ར་ཐམས་ཅད་དུ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་དང་། མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་ཐར་པའི་བདེ་བ་ལ་རེག་པར་བགྱིས་ནས་མི་གཡོ་བའི་ཏིང་ངེ་འཛིན་ལ་འཇུག་ཅིང་མགོ་མཉམ་པ་ཉིད་དུ་འགྱུར་བ་དང་། སུས་ཐོས་པ་དེའི་ཉོན་མོངས་པ་འདོད་ཆགས་ལ་སོགས་པ་བསྲབས་པར་འགྱུར་ཞིང་།
en: This dhāraṇī mantra accomplishes everything from undivided great protection up to parinirvāṇa. It generates in sacred beings feelings of revulsion toward the entire prison of the three realms, it connects them to the happiness of liberation related to the absorption of the absence of marks, and it causes them to enter unshakeable absorptions and become composed. Those who hear it will experience the diminution of all their afflictions, such as desire.

source: དེ་ལྷ་རྣམས་ཀྱི་ནང་དུ་ཚེ་རབས་བདུན་འཁོར་བར་འགྱུར་བ་དང་། ལྷའི་དྲང་སྲོང་དུ་འགྱུར་བ་དང་། དེའི་སེམས་འདོད་པ་རྣམས་ཀྱིས་གོས་པར་མི་འགྱུར་བ་དང་། ལྷ་ཐམས་ཅད་ཀྱིས་མཆོད་པའི་འོས་སུ་གྱུར་པ་དང་། དེ་དེ་ནས་ཤི་འཕོས་ནས་འདིར་མི་རྣམས་ཀྱི་ནང་དུ་ཚེ་རབས་བདུན་འཁོར་བར་འགྱུར་བ་དང་། དེའི་སེམས་འདོད་པ་རྣམས་ཀྱིས་གོས་པར་མི་འགྱུར་བ་དང་། མིའི་དྲང་སྲོང་དུ་འགྱུར་བ་དང་། ལྷ་དང་མི་ཐམས་ཅད་ཀྱིས་མཆོད་པའི་འོས་སུ་གྱུར་པ་དང་། ཕྱག་བགྱི་བའི་འོས་སུ་གྱུར་པར་འགྱུར་བ་དེ་གང་ལགས།
en: They will circle for seven lifetimes as sages among the gods, their minds will not be sullied by desires, and they will be worthy to be worshiped by all the gods. Then, after they die, they will circle for seven lifetimes among humans. Their minds will not be sullied by desires, they will be sages among humans, and they will be worthy to be worshiped and revered by all humans and gods.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཌི་ནྱ་མི་དགའ་བར་མ་བྱེད་ཅིག་ཆོག་གོ།
en: “Do not be upset, Kauṇḍinya, it is very good,” replied the Blessed One.

source: །ཀཽ་ཌི་ནྱ་ཉི་མ་དང་ལྡན་པའི་གཟུངས་སྔགས་འདི་ཉན་ཐོས་དང་རང་རྒྱལ་བ་རྣམས་ཀྱིས་མ་ཡིན་ནོ།
en: “Kauṇḍinya, this dhāraṇī mantra connected to the sun is not for the hearers or the solitary buddhas.

source: །ཉི་མའི་མིག་པད་མའི་གཟུངས་སྔགས་འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་རྒྱུ་འཐུན་པ་དག་ཡིན་ནོ།
en: This dhāraṇī mantra, the lotus of the sun’s eye, is the concordant cause of the eighteen unique qualities of the buddhas.

source: །ཀཽ་ཌི་ནྱ་གལ་ཏེ་ངས་བསྐལ་པ་བརྒྱ་སྟོང་དུ་ཉི་མའི་མིག་གི་གཟུངས་སྔགས་འདིའི་དོན་བསྟན་ཀྱང་བསྐལ་པ་བརྒྱ་སྟོང་ནི་ཟད་པར་འགྱུར་གྱི་རྒྱ་ཆེར་དོན་ཐམས་ཅད་བརྗོད་པར་མི་ནུས་སོ།
en: Kauṇḍinya, even if I were to teach about the meaning of this dhāraṇī mantra, the sun’s eye, for a hundred thousand eons, those hundred thousand eons would come to an end before I could expound its entire meaning in detail.

source: །འདི་ལ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་རྨོངས་པར་ཡང་འགྱུར་རོ།
en: The world with its gods would be confused about it.

source: །འདི་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཉིད་མ་གཏོགས་པར་མངོན་སུམ་པ་གཞན་གང་ཡང་མེད་དོ།
en: Apart from the thus-gone ones, the worthy ones, the perfect buddhas themselves, no one can apprehend it directly.

source: །ཉི་མའི་མིག་གི་གཟུངས་སྔགས་འདི་ནི་དོན་དཔག་ཏུ་མེད་པ་མཐོང་བར་དཀའ་བ། རྟོགས་པར་དཀའ་བ་ཡིན་ནོ།
en: The meaning of this dhāraṇī mantra, the sun’s eye, is unfathomable, difficult to perceive, and hard to realize.

source: །དེ་བཞིན་དུ་མི་ཟད་པའི་སྦུ་བུ་དང་། དེ་བཞིན་དུ་རིག་སྔགས་ཀྱི་རྟེན་དང་། དེ་བཞིན་དུ་སྡང་བ་ཞི་བར་བྱེད་པ། གཉིད་ཀྱིས་ལོག་པར་བྱེད་པའི་གཟུངས་སྔགས་ནི་དོན་དཔག་ཏུ་མེད་ལ་མཐོང་བར་དཀའ་བ་ཁོང་དུ་ཆུད་པར་དཀའ་བ་ཡིན་ཏེ།
en: Similarly, the meanings of the inexhaustible core, the fundamental knowledge mantra, and the dhāraṇī mantra that pacifies and puts to sleep hostile beings are unfathomable, difficult to perceive, and hard to comprehend.

source: འདི་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཉིད་མ་གཏོགས་པར་མངོན་སུམ་པ་གཞན་གང་ཡང་མེད་དོ།
en: Apart from the thus-gone ones themselves, no one can apprehend them directly.”

source: །ཀཽ་ཌི་ནྱས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་གང་དེ་བཞིན་གཤེགས་པ་རི་དབང་རྒྱལ་པོ་དེས་སྟོང་པ་ཉིད་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོས་ཀྱི་གླང་པོ་ཆེའི་ལག་ནས་བསྐུར་བ་བཤད་པར་གསོལ།
en: Kauṇḍinya then said, “Respected Blessed One, please explain to us the dhāraṇī mantra that accords with emptiness that the thus-gone King of the Lord of Mountains conferred through the bodhisattva great being Gandhahastin!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཌི་ནྱ་དེ་བཞིན་ཏེ།
en: The Blessed One replied, “Thus it is, Kauṇḍinya.

source: གང་དེ་བཞིན་གཤེགས་པ་རི་དབང་རྒྱལ་པོས་འདིར་ང་ལ་བསྐུར་བ་འདུས་པ་འདིར་ངས་བཤད་པ་ལ་དད་པ་སྦྱིན་པར་མཛད་པ་སྟོང་པ་ཉིད་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་མདུན་དུ་ངས་བཤད་པར་བྱའོ།
en: In the presence of the world with its gods, I will now explain the dhāraṇī mantra that accords with emptiness that the thus-gone King of the Lord of Mountains conferred upon me in this place. This dhāraṇī mantra bestows faith in the teachings that I expound within this assembly.

source: །འདི་ལྟར་འདི་ནི་འདིར་ངས་བཤད་ན་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པའི་དོན་བྱེད་པ་ཡིན་ཞིང་འདིར་སེམས་ཅན་རྣམས་ཀྱིས་མངོན་སུམ་དུ་གྱུར་པར་འགྱུར་རོ།
en: If I explain it here, an innumerable and limitless number of sentient beings will benefit, and they will apprehend it directly.

source: །ཀཽ་ཌི་ནྱ་དེའི་ཕྱིར་ཁྱོད་ཅེས་བྱ་བ་ནས་བཅོམ་ལྡན་འདས་དེས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ་ཞེས་བྱ་བའི་བར་ཏོ། །ཀཽ་ཌི་ནྱ་འདི་ལ་སེམས་ཅན་གང་དག་འདོད་ཆགས་ཀྱི་རྒྱགས་པས་མྱོས་ཤིང་ངེས་པར་འབྱུང་བར་མི་ལྟ་བས་གནས་པ་དེ་དག་ཡུན་རིང་པོར་འཁོར་བར་བྱེད་པར་འགྱུར་རོ།
en: Therefore, Kauṇḍinya, listen!” [. . .] The Blessed One then said, “Kauṇḍinya, sentient beings who are intoxicated by the arrogance associated with attachment and who do not care about emancipation will circle in saṃsāra for a long time.

source: །ཡུན་རིང་པོར་ངན་སོང་གསུམ་དུ་སྡུག་བསྔལ་གྱི་ཚོར་བ་རྩུབ་པ་མི་ཟད་པ་མྱོང་བར་འགྱུར་རོ།
en: They will experience endless harsh feelings of suffering in the three lower realms.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེས་ཏེ།
en: The great compassion of the bodhisattva great beings arises for their sake.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེའི་སྟོབས་ཆེན་པོ་དང་། བརྩོན་འགྲུས་དང་། བརྩོན་པ་དང་། བརྟུལ་བ་ཆེན་པོས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་ཚོལ་བར་བྱེད་དོ། །དེ་དག་མྱུར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Then, through the great strength of their compassion, through their great diligence, exertion, and discipline, those bodhisattva great beings swiftly pursue unsurpassed and perfect awakening, and they quickly awaken to perfect buddhahood.

source: །སེམས་ཅན་རྣམས་ངན་སོང་གསུམ་ལས་བསྒྲལ་བའི་ཕྱིར་ངེས་པར་འབྱེད་པ་དང་། ངེས་པར་འབྱིན་པ་དང་། གཅེས་སྤྲས་བྱེད་པས་ཡང་དག་པར་སྡུག་བསྔལ་ཟད་པར་འགྲོ་བར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: With insight, ascertainment, and care and in order to liberate those beings from the three lower realms they teach the Dharma that leads to the exhaustion of suffering.

source: །སེམས་ཅན་གང་དག་ཆོས་བསྟན་པ་དེ་ཉན་པར་བྱེད་ཅིང་སྡུག་བསྔལ་ལས་ངེས་པར་འབྱུང་བར་ལྟ་བ་དེ་དག་འབྲས་བུ་དང་པོ་ཐོབ་པར་བྱེད་དོ་ཞེས་བྱ་བ་ནས་འབྲས་བུ་བཞི་པའི་བར་དུ་ཐོབ་པར་བྱེད་དོ།
en: Sentient beings who listen to these teachings with the intention of escaping from suffering will attain the first fruition as well as the other fruitions up to the fourth one.

source: །ཡང་ན་གལ་ཏེ་གང་དག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཡོངས་སུ་བཙལ་བར་བྱ་བའི་ཕྱིར་འཁོར་བའི་སྡུག་བསྔལ་འཇིགས་སུ་རུང་བ་རྣམས་ལ་སྤྲོ་བར་བྱེད་པ་དེ་དག་བླ་ན་མེད་པའི་ཡེ་ཤེས་རྗེས་སུ་ཐོབ་ནས་སེམས་ཅན་རྣམས་འདོད་པ་དག་ལ་ངེས་པར་འབྱུང་བར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་པར་མཛད་དེ། དཔེར་ན་ད་ལྟར་ང་བཞིན་ནོ།
en: Alternatively, those who are eager to take on the frightening sufferings of saṃsāra in the pursuit of unsurpassed wisdom for the sake of all beings will attain unsurpassed wisdom, and they will then teach the Dharma to emancipate beings from their desires—just as I am doing now.

source: །ཀཽ་ཌི་ནྱ་དེ་ལ་རེག་པའི་འདོད་ཆགས་གང་ཞེ་ན། སེམས་ཅན་གང་དག་གཅིག་ལ་གཅིག་ལུས་ཀྱིས་རེག་པས་རེག་པར་གྱུར་པ་དེ་དག་བདེ་བའི་ཚོར་བ་མྱོང་བས་སྡུག་བསྔལ་སྐྱེ་བར་བྱེད་དོ།
en: “Kauṇḍinya, what is meant by ‘attachment to contact?’ Sentient beings who connect with one another through physical contact experience pleasant feelings that generate suffering.

source: །སྡུག་བསྔལ་སོ་སོ་ཡང་དག་པར་མྱོང་བར་བྱེད་དོ།
en: This will cause them to experience suffering acutely.

source: །དཔེར་ན་སྦྲུལ་གདུག་པ་གཏུམ་པོ་ཁ་ཅིག་ལྟ་བས་སེམས་ཅན་རྣམས་གསོད་པར་བྱེད།
en: As an analogy, some deadly poisonous snakes kill beings by staring at them.

source: ཁ་ཅིག་དབུགས་ཙམ་གྱིས་སེམས་ཅན་རྣམས་གསོད་པར་བྱེད་དོ།
en: Other snakes will kill beings with merely their breath.

source: །ཁ་ཅིག་རེག་པ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་གསོད་པར་བྱེད།
en: Still other snakes kill beings merely by contact.

source: ཁ་ཅིག་སྦྱོར་བ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་གསོད་པར་བྱེད་པ་དེ་བཞིན་དུ་སེམས་ཅན་ཁ་ཅིག་ནི་མཐོང་བ་ཙམ་གྱིས་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཆུད་གསོན་པར་བྱེད་ཅིང་རབ་ཏུ་སྲེག་པར་བྱེད་དོ།
en: Finally, other snakes will kill beings merely by connecting with them. Likewise, some sentient beings waste and consume all their roots of virtue through a mere visual contact.

source: །ཁ་ཅིག་ནི་གཅིག་ལ་གཅིག་ལུས་ཀྱིས་རེག་པས་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཆུད་གསོན་ཅིང་རབ་ཏུ་སྲེག་པར་བྱེད་དོ།
en: Some waste and consume all their roots of virtue by touching one another physically.

source: །ཁ་ཅིག་ནི་འཇུག་པ་ཙམ་གྱིས་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཆུད་གསོན་ཅིང་རབ་ཏུ་སྲེག་པར་བྱེད་དོ།
en: Some waste and consume all their roots of virtue through a mere interaction.

source: །ཁ་ཅིག་ནི་འཁྲིག་པ་དང་ལྡན་པའི་ཀུན་ཏུ་སྦྱོར་བའི་རེག་པ་ཙམ་གྱིས་སྡུག་བསྔལ་སྐྱེད་པར་བྱེད་ཅིང་དེ་དག་སྡུག་བསྔལ་སོ་སོ་ཡང་དག་པར་མྱོང་བར་བྱེད་དོ།
en: Still others give rise to and experience suffering acutely through the mere contact of sexual intercourse.

source: །ཀཽ་ཌི་ནྱ་དེ་ལ་རེག་པའི་འདོད་ཆགས་ལས་ངེས་པར་འབྱུང་བ་གང་ཞེ་ན།
en: “Kauṇḍinya, what is the emancipation from attachment to contact?

source: ཀཽ་ཌི་ནྱ་འདི་ན་རུས་པའི་ཕུང་པོ་གཟུགས་གསལ་བ་ལ་སོ་སོར་བརྟག་པར་བྱའོ།
en: Kauṇḍinya, in this context, beings should investigate the clear form of the heaps of bones.

source: །ཇི་ལྟར་ཞེ་ན།
en: How should they do so?

source: གང་དུ་གཟུགས་འདོད་པ་སྡུག་པ། ཕངས་པ། ཡིད་དུ་འོང་བ། འདོད་པ་དང་ལྡན་པ། ཆགས་པར་འགྱུར་བ་རྣམས་མཐོང་ནས་དེ་ལ་བྱང་གྲོལ་གྱི་བདེ་བ་འདོད་པ་དེ་འདི་ལྟར་སོ་སོ་ཡང་དག་པར་སློབ་པར་བྱེད་དེ། གཟུགས་འདི་ནི་འབྱུང་བ་ཆེན་པོ་བཞི་ལས་གྱུར་པ། འཇིག་ཅིང་རྣམ་པར་འཇིག་ལ་རྣམ་པར་ཕྱེ་མར་འགྱུར་བའི་ངོ་བོ་ཉིད་དོ།
en: Upon seeing desirable, attractive, pleasing, and enticing physical forms that generate in them desire and lust, they should cultivate a wish for the happiness of emancipation by seeing that physical forms are made of the four great elements—by their very nature they will perish, disintegrate, and turn into dust.

source: དེ་ན་རུས་པའི་ཕུང་པོ་སྐྲ་མེད་པ་དང་། ཤ་དང་། སེན་མོ་དང་། ཁྲག་མེད་པ་དང་། སྟོང་པ་དང་། ཤིན་ཏུ་དཀར་ཞིང་དུང་གི་མདོག་ལྟ་བུ་དང་། རྒྱུས་པས་འབྲེལ་བར་ཡིད་ལ་བྱེད། ཡང་དག་པར་ཤེས་པར་བྱེད། རབ་ཏུ་སྦྱོར་བར་བྱེད། བྱིན་གྱིས་རློབ་པར་བྱེད་དེ། དེས་དེ་ཁོ་ན་བཞིན་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་མཐོང་ངོ་།
en: They will perceive this exactly as it is by contemplating, cognizing, envisaging, and visualizing the heaps of bones that are hairless and covered with flesh, have fingernails attached, and are devoid of blood, bare, completely white like conch shells, and connected with ligaments.

source: །དེ་དེ་ལ་སྟེན་ཅིང་སྒོམ་ལ་ལན་མང་དུ་བྱེད་པ་ན་མཚན་མོ་ཇི་ལྟ་བར་ཉིན་པར་ཡང་དེ་བཞིན་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ཞིང་། དེ་འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་སྐྱེད་དོ།
en: As they pursue, cultivate, and repeat this process many times, they will genuinely perceive these heaps of bones both day and night, and this will generate in them feelings of revulsion toward the entire world.

source: །དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ནི་རྒ་ཤིའི་འཇིགས་པས་གནོད་པར་གྱུར་པ་ཡིན་པས་གང་བདག་གིས་རྒ་ཤིའི་རྔ་བོ་ཆེ་འདི་མ་ལུས་པར་གཅག་གོར་མ་ཆག་སྙམ་མོ།
en: They will think, ‘Since I am subject to the terrors of old age and death, I must definitely smash to pieces this great vessel of old age and death!

source: །ཇི་ལྟར་བདག་གིས་རྒ་ཤིའི་རྔ་བོ་ཆེ་མ་ལུས་པར་གཞིག་པར་ནུས་ཞེ་ན།
en: How will I be able to completely destroy this great vessel of old age and death?

source: གང་བདག་གིས་རུས་པའི་ཕུང་པོ་འདི་ལ་ཤིན་ཏུ་སོ་སོར་བརྟག་པར་བྱས་པས་མ་ལུས་པར་གཞིག་པར་བྱ་གོར་མ་ཆག་སྙམ་ནས་དེ་ཐམས་ཅད་དང་ལྡན་པའི་རུས་པའི་ཕུང་པོ་འདི་ལ་སོ་སོར་རྟོག་པར་བྱེད་དེ། གང་དེ་ཐམས་ཅད་ལ་དཀར་པོའི་འདུ་ཤེས་ཡིད་ལ་བྱེད་པ་འདི་ནི་དེའི་ཞི་གནས་སུ་འགྱུར་རོ།
en: I must do so by carefully investigating this heap of bones!’ Thinking in that way, they will investigate this entire heap of bones, and their attention placed on the perception of the white color of all those bones will become their practice of tranquility.

source: །དེ་འདི་ནི་བདག་གི་མགོའི་རུས་པའོ་ཞེས་བྱ་བ་ནས་དེ་བཞིན་དུ་འདི་ནི་བདག་གི་རྐང་པའི་མཐེ་བོའི་རུས་པའོ་ཞེས་བྱ་བའི་བར་དུ་དེ་ལྟར་སོ་སོར་རྟོག་པར་བྱེད་ཅིང་རྒ་ཤིའི་རྔ་བོ་ཆེ་འདི་གཞིག་པར་བྱ་བའི་ཕྱིར་བདག་གིས་གནས་གང་དུ་ལྷག་མཐོང་གིས་བརྩམ་པར་བྱ་སྙམ་མོ། །དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཁ་དང་སྣ་གཉིས་ཀྱི་རླུང་འདུས་པས་རྒ་ཤིའི་རྔ་བོ་ཆེ་རང་གི་རུས་པའི་ཕུང་པོ་འདི་མ་ལུས་པར་གཞིག་པར་བྱའོ་སྙམ་ནས་དེ་སྣའི་རྩེ་མོར་རླུང་འདུས་པས་ཡང་དག་པར་རྩོམ་པར་བྱེད་དེ།
en: “They will further pursue their investigation by observing ‘These are the bones of my skull’ all the way down to ‘These are the bones of my toes.’ They will wonder, ‘In order to destroy this great vessel of old age and death, where should I undertake the practice of insight?’ They will then think, ‘I must destroy my heap of bones—this great vessel of old age and death—by gathering the winds in my mouth and nose!’ With that thought in mind, they will begin by gathering the winds at the tips of their noses.

source: རྡུལ་ཕྲ་རབ་ཙམ་དུ་རུས་པ་འཇིག་པར་བྱེད་དོ། །རླུང་གིས་འཕྱར་བར་བྱེད་དོ།
en: Then, they will pulverize their bones into the finest particles of dust, and with those winds they will blow this dust away.

source: །སྦྱོར་བ་དེས་རང་གི་རུས་པའི་ཕུང་པོ་ཐམས་ཅད་འཇིག་པར་འགྱུར་རོ།
en: Through that practice, all their heaps of bones will be disintegrated.

source: །ཇི་ལྟར་རང་གི་རུས་པའི་ཕུང་པོ་ཐམས་ཅད་ལྷག་མ་མེད་པར་རླུང་གིས་ཁྱེར་བར་གྱུར་པ་བཞིན་དེའི་རང་གི་ལུས་དེ་ལ་གང་རུས་པའི་འདུ་ཤེས་བྱུང་བ་དེ་སྤངས་ཤིང་དེར་དེ་ལ་སྟོང་པར་སྣང་སྟེ།
en: Just as all their heaps of bones are blown away by the winds without any remainder, so will they discard their own body, which gives rise to the perception of bones, and thus all of it will appear to be empty.

source: འདི་སྟོང་པ་ཉིད་ཀྱི་ཡན་ལག་དང་པོའོ།། །།
en: This is the first branch of emptiness.

source: གཞན་ཡང་དེ་ལ་བདག་ནང་སྟོང་པ་ཉིད་དུ་སྣང་ངོ་། །དེ་ལ་ཕྱི་རོལ་ནི་གཟུགས་ཀྱི་འདུ་ཤེས་སུ་འགྱུར་རོ།
en: “Furthermore, their identities will appear to them as the emptiness of the inner, but they will still perceive outer physical forms.

source: །དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་རླུང་འདུས་པ་དེས་གཟུགས་སྣང་བ་ཐམས་ཅད་རྣམ་པར་གཞིག་པར་བྱའོ་སྙམ་ནས་དེ་དེ་ལྟར་རླུང་འདུས་པས་ཕྱི་རོལ་གྱིས་གཟུགས་སྣང་བ་གང་ཅི་ཡང་རུང་བ་ཐམས་ཅད་རླུང་གིས་རྣམ་པར་འཇིག་པར་བྱེད་དོ།
en: They will think, ‘I must disintegrate all material appearances by gathering the winds!’ By doing so, all outer appearances of form will be disintegrated by those winds.

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་ནང་ངམ་ཕྱི་རོལ་གྱི་གཟུགས་སྣང་བ་ཐམས་ཅད་སྤངས་ནས་བྱེ་བྲག་ཏུ་ཡིད་ལ་བྱེད་པ་འདི་ནི་སྟོང་པ་ཉིད་ཀྱི་ཡན་ལག་གཉིས་པའོ།
en: Having entirely abandoned all the inner and outer appearances of form, they will specifically contemplate this. This is the second branch of emptiness.

source: །ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་གཟུགས་སྣང་བ་གང་སྤངས་པ་ཐམས་ཅད་ནི་བདག་ལ་སྟོང་པར་སྣང་གི་གཞན་ནི་མ་ཡིན་ནོ།
en: “Again, they will think, ‘All the material appearances I have abandoned appear to me as emptiness and not in any other way.

source: །དེས་ན་བདག་གི་རླུང་དུ་ཀུན་ཏུ་རྟོག་པའི་སེམས་འདི་ཡང་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ་མ་ཡིན་པས་དེ་བདག་གིས་སྤང་བར་བྱའོ། །ཆོས་ནི་གང་དུ་ཡང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད་དེ། དེ་དེ་ལྟར་འགྲོ་བ་མེད་པའི་ཚུལ་ལམ། བདག་ཉིད་འགྲོ་བའི་ཚུལ་གྱིས་རྟོག་པ་སྤོང་བར་བྱེད་དེ་འདི་ནི་སྟོང་པ་ཉིད་ཀྱི་ཡན་ལག་གསུམ་པའོ།
en: However, since my mind that conceives the winds is not entirely liberated, I must abandon that too!’ Since phenomena do not come from or go anywhere, they will give up conceptualizing in terms of going or the absence of going. This is the third branch of emptiness.

source: །ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཅི་འདུས་བྱས་ཐམས་ཅད་ལ་དེ་ཁོ་ན་ཡང་དག་པ་ཅི་ཡང་ཡོད་དམ་སྙམ་ནས་དེ་ཡང་དག་པ་མངོན་སུམ་དུ་གྱུར་པ་དེ་ཤེས་པར་བྱས་ཏེ།
en: “Again, they will wonder, ‘Is there anything true at all among all conditioned things?’ Thinking in that way, they will directly understand what is true.

source: ཀུན་འབྱུང་བའི་ཆོས་གང་ཅི་ཡང་རུང་བ་ཐམས་ཅད་འགོག་པའི་ཆོས་སུ་རིག་པར་བྱས་ནས་དེས་ཁམས་གསུམ་པ་ཐམས་ཅད་མེད་ཅིང་ཡང་དག་པ་མ་ཡིན་པར་ཤེས་ཏེ། དེའི་འདུ་བྱེད་ཤིན་ཏུ་སྦྱངས་ཤིང་ཞི་བར་འགྱུར་བ་འདི་ནི་སྟོང་པ་ཉིད་ཀྱི་ཡན་ལག་བཞི་པའོ།
en: Knowing that all phenomena that arise are phenomena that cease, they will understand that all three realms are nonexistent and unreal, and their formations will become utterly purified and pacified. This is the fourth branch of emptiness.

source: །ཁ་ཅིག་ནི་འདིར་འབྲས་བུ་དང་པོ་ལ་གནས་པར་བྱེད་དོ། །ཁ་ཅིག་ནི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་སྒོམ་པར་བྱེད་དོ། །ཁ་ཅིག་ནི་དུས་དང་རྐྱེན་ཇི་ལྟ་བ་བཞིན་དུ་བྱང་ཆུབ་ལ་རེག་པར་བྱེད་དོ།
en: “Some will settle within the first fruition, some will cultivate the concordant acceptance, and some will reach awakening in accordance with the right times and circumstances.

source: །གང་རྟོག་པ་དང་དཔྱོད་པ་འབའ་ཞིག་རྣམ་པར་ཞི་བར་བྱ་བའི་ཕྱིར་བརྩོན་པ་ནི་རྣམ་པར་ཞི་བར་འགྱུར་རོ། །དེ་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་འཇུག་པར་བྱེད་དེ།
en: Their efforts to entirely settle concepts and analysis will be completely pacified, and they will enter the absorption of cessation.

source: དེ་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་འགོག་པས་ཉིན་ཞག་གཅིག་འདའ་བར་བྱེད་དོ་ཞེས་བྱ་བ་ནས་བསྐལ་པ་དཔག་ཏུ་མེད་པའི་བར་དུ་འདའ་བར་བྱེད་དོ།
en: According to their inclinations, they will pass from one day up to countless eons absorbed in that cessation.

source: །དང་པོ་དེ་ལངས་མ་ཐག་ཏུ་སྐད་ཅིག་མ་གཉིས་པ་ལ་ཉོན་མོངས་པ་ཟད་པ་ན་ཚེ་ཡང་ཟད་པར་གྱུར་ནས་དེ་མགོ་མཉམ་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་བྱེད་དོ།
en: In the second instant immediately following the first instant of emerging from that, their afflictions will be exhausted. At that moment, their lives will also be exhausted, and they will simultaneously pass into parinirvāṇa.

source: །འདི་ནི་སྟོང་པ་ཉིད་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་བརྒྱད་པ་ཡིན་ཏེ།
en: “This is the eighth, the dhāraṇī mantra that accords with emptiness.

source: སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་མ་ཡིན་པ་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་མཐུ་ཆེ་བ། ཕན་ཡོན་ཆེ་བ།
en: It is a powerful and beneficial dhāraṇī mantra that accords with the truth that is not shared by ordinary beings.

source: འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཡང་དག་པར་ཟད་པར་བྱེད་པ། གཟུགས་དང་གཟུགས་མེད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཡང་དག་པར་ཟད་པར་བྱེད་པ་ཞེས་བྱ་བ་ནས་སྡུག་བསྔལ་གྱི་ཁུར་འདོར་བར་བྱེད་པ་ཞེས་བྱ་བའི་བར་ཡིན་ནོ།
en: It exhausts all forms of attachment associated with the desire realm, the form realm, and the formless realm, [. . .] and it removes the burden of suffering.

source: །དེ་ནི་དེ་བཞིན་གཤེགས་པ་རི་དབང་རྒྱལ་པོས་ང་ལ་སྟོང་པ་ཉིད་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོས་ཀྱི་གླང་པོ་ཆེའི་ལག་ནས་བསྐུར་བ་དང་འདུས་པ་འདི་ལ་ངས་བཤད་པ་ལ་དད་པ་སྦྱིན་པར་མཛད་པ་ཡིན་ནོ།
en: It is the dhāraṇī mantra that accords with emptiness that the thus-gone King of the Lord of Mountains conferred upon me through the bodhisattva great being Gandhahastin. It is a dhāraṇī mantra that bestows faith in the teachings that I expound within this assembly.”

source: །བསྟན་པ་འདི་བཤད་པ་ན་དེར་སེམས་ཅན་བྱེ་བ་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་འབྲས་བུ་དང་པོ་ལ་གནས་པར་གྱུར་ཏོ། །འབུམ་ཕྲག་དྲུག་ཅུ་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ།
en: As this teaching was being given, ninety-two trillion sentient beings settled within the first fruition, and the minds of six million of them were liberated from their defilements with no further grasping.

source: །སྔོན་ལས་བྱས་པའི་སེམས་ཅན་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་དགུ་ནི་སྟོང་པ་ཉིད་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ཐོབ་པར་གྱུར་ཏོ། །སྲོག་ཆགས་བརྒྱད་ཁྲི་ནི་རང་བྱུང་ཅན་གྱི་གཟུངས་སྔགས་ཐོབ་པར་གྱུར་ཏོ།
en: Nine hundred ninety trillion sentient beings who had performed their duties in the past achieved the dhāraṇī mantra that accords with emptiness, and eighty thousand of them achieved the self-arisen dhāraṇī mantra.

source: །དེར་སེམས་ཅན་དཀྲིགས་ཕྲག་དྲུག་ཅུས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ།
en: Sixty quintillion sentient beings gave rise to the mind set on unsurpassed and perfect awakening and would no longer regress on the path to unsurpassed and perfect awakening.

source: །དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་ལེགས་སོ་ཞེས་བྱ་བ་གསོལ་ཏེ། ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་སྤོས་ཀྱི་ཆར་མངོན་པར་རབ་ཏུ་བབ་པར་གྱུར་ཏོ།
en: The entire retinue exclaimed “Excellent!” and showered a rain of celestial flowers and perfumed substances.

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀཽ་ཌི་ནྱས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དཔལ་བརྩེགས་རྒྱལ་པོ་དེས་སྨོན་པ་མེད་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྣང་བའི་དཔལ་སྙིང་པོའི་ལག་ནས་བསྐུར་བ་དང་། འདུས་པ་ཆེན་པོ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ལ་དད་པ་སྦྱིན་པར་མཛད་པ་བཤད་པར་གསོལ།
en: Venerable Kauṇḍinya then said to the Blessed One, “Respected Blessed One, please explain to us the dhāraṇī mantra that accords with the absence of wishes that the thus-gone Royal Mass of Glorious Wisdom conferred through the bodhisattva great being Glorious Essence of Light, the dhāraṇī mantra that bestows faith in this great teaching of The Great Assembly!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཌི་ནྱ་དེ་དེ་བཞིན་ནོ།
en: The Blessed One replied, “Kauṇḍinya, thus it is!

source: །ཀཽ་ཌི་ནྱ་དེ་དེ་བཞིན་ཏེ།
en: Kauṇḍinya, thus it is!

source: ཀཽ་ཌི་ནྱ་འཁོར་འདི་ལ་སྨོན་པ་མེད་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ངས་བཤད་པར་བྱའོ།
en: Kauṇḍinya, I will explain to this retinue the dhāraṇī mantra that accords with the absence of wishes.

source: །ཀཽ་ཌི་ནྱ་འཁོར་འདི་ན་སེམས་ཅན་གང་དག་སྔོན་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་དང་ཆོས་འདི་ཀུན་ཏུ་ཤེས་པར་ནུས་པ་དག་ཡོད་དོ། །ཀཽ་ཌི་ནྱ་དེའི་ཕྱིར་ཉོན་ལ་ཞེས་བྱ་བ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ་ཞེས་བྱ་བའི་བར་དུའོ། །ཀཽ་ཌི་ནྱ་འདི་ན་སེམས་ཅན་གང་དག་མ་མོས་ཤིང་འདོད་ཆགས་དང་ཡང་དག་པར་རྗེས་སུ་འབྲེལ་བ་དག་ཡོད་དེ།
en: Kauṇḍinya, there are sentient beings within this retinue who have thoroughly purified themselves in the past and are able to understand this teaching. Therefore, Kauṇḍinya, listen!” [. . .] The Blessed One then said, “Kauṇḍinya, there are sentient beings here who lack dedication and are entangled in desire.

source: དེ་དག་ངེས་པར་འབྱུང་བ་རབ་ཏུ་མི་ཤེས་ཤིང་། དེ་དག་ངེས་པར་འབྱུང་བར་མི་ལྟ་བས་ཡུན་རིང་པོར་འཁོར་བར་འཁོར་བར་འགྱུར་རོ་ཞེས་བྱ་བ་ནས་ཡིད་ཀྱིས་ཀུན་ཏུ་རྟོག་པའི་འདོད་ཆགས་ལས་ངེས་པར་འབྱུང་བ་གང་ཞེ་ན་ཞེས་བྱ་བ་དང་། འདི་ལ་ཇི་ལྟར་ཡང་དག་པར་བསླབ་པར་བྱ་ཞེ་ན་ཞེས་བྱ་བའི་བར་དུའོ།
en: They do not understand or care about emancipation, and so they will circle in saṃsāra for a long time. [. . .] “What is emancipation from the attachment to mental concepts, and how does one correctly train in it?
